tiborsimon/embedded-tdd-headers/pic/pic18/pic18c442_tdd.h
#define STATUS                        522
#define C                             523
#define CARRY                         524
#define DC                            525
#define ZERO                          526
#define Z                             527
#define OV                            528
#define OVERFLOW                      529
#define N                             530
#define NEGATIVE                      531
#define INTCON3                       532
#define INT1IF                        533
#define INT1F                         534
#define INT2IF                        535
#define INT2F                         536
#define INT1E                         537
#define INT1IE                        538
#define INT2IE                        539
#define INT2E                         540
#define INT1P                         541
#define INT1IP                        542
#define INT2IP                        543
#define INT2P                         544
#define INTCON2                       545
#define RBIP                          546
#define TMR0IP                        547
#define T0IP                          548
#define INTEDG2                       549
#define INTEDG1                       550
#define INTEDG0                       551
#define RBPU                          552
#define NOT_RBPU                      553
#define nRBPU                         554
#define INTCON                        555
#define RBIF                          556
#define INT0F                         557
#define INT0IF                        558
#define T0IF                          559
#define TMR0IF                        560
#define RBIE                          561
#define INT0E                         562
#define INT0IE                        563
#define T0IE                          564
#define TMR0IE                        565
#define PEIE                          566
#define PEIE_GIEL                     567
#define GIEL                          568
#define GIE_GIEH                      569
#define GIE                           570
#define GIEH                          571
#define STKPTR0                       572
#define STKPTR                        573
#define SP0                           574
#define STKPTR1                       575
#define SP1                           576
#define STKPTR2                       577
#define SP2                           578
#define SP3                           579
#define STKPTR3                       580
#define STKPTR4                       581
#define SP4                           582
#define STKUNF                        583
#define STKOVF                        584
#define STKFUL                        585

#endif // _PIC18C442_H_
